<a href="https://colab.research.google.com/github/ravisiddam/DL_Project_1/blob/master/Untitled54.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [0]:
 url = ('https://raw.github.com/pandas-dev/pandas/master/pandas/tests/data/tips.csv')

In [0]:
tips = pd.read_csv(url)

In [4]:
tips.shape

(244, 7)

In [5]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [7]:
#select
# SELECT total_bill, tip, smoker, time from tips LIMIT 5
tips[['total_bill', 'tip', 'smoker', 'time']].head()

   total_bill   tip smoker    time
0       16.99  1.01     No  Dinner
1       10.34  1.66     No  Dinner
2       21.01  3.50     No  Dinner
3       23.68  3.31     No  Dinner
4       24.59  3.61     No  Dinner

In [8]:
#filter
#SELECT * from tips where time = 'Dinner' LIMIT 5
tips[tips['time'] == 'Dinner'].head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [9]:
#SELECT * from tips where time = 'Dinner' and tip > 5.00;
tips[(tips['time'] == 'Dinner') & (tips['tip'] > 5.00)]

     total_bill    tip     sex smoker  day    time  size
23        39.42   7.58    Male     No  Sat  Dinner     4
44        30.40   5.60    Male     No  Sun  Dinner     4
47        32.40   6.00    Male     No  Sun  Dinner     4
52        34.81   5.20  Female     No  Sun  Dinner     4
59        48.27   6.73    Male     No  Sat  Dinner     4
116       29.93   5.07    Male     No  Sun  Dinner     4
155       29.85   5.14  Female     No  Sun  Dinner     5
170       50.81  10.00    Male    Yes  Sat  Dinner     3
172        7.25   5.15    Male    Yes  Sun  Dinner     2
181       23.33   5.65    Male    Yes  Sun  Dinner     2
183       23.17   6.50    Male    Yes  Sun  Dinner     4
211       25.89   5.16    Male    Yes  Sat  Dinner     4
212       48.33   9.00    Male     No  Sat  Dinner     4
214       28.17   6.50  Female    Yes  Sat  Dinner     3
239       29.03   5.92    Male     No  Sat  Dinner     3

In [0]:
frame = pd.DataFrame({'col1': ['A', 'B', np.NaN, 'C', 'D'], 'col2': ['F', np.NaN, 'G', 'H', 'I']})

In [11]:
#select * from where col2 IS NULL;
frame[frame['col2'].isna()]

  col1 col2
1    B  NaN

In [13]:
#Select * from tips where col1 is not null;
frame[frame['col1'].notna()]

  col1 col2
0    A    F
1    B  NaN
3    C    H
4    D    I

In [16]:
#select * from tips group by sex;
tips.groupby('sex')['tip', 'size'].count()

        tip  size
sex
Female   87    87
Male    157   157

In [17]:
#Select day, avg(tip), count(*) from tips group by day;
tips.groupby('day').agg({'tip': np.mean, 'day': np.size})

           tip  day
day
Fri   2.734737   19
Sat   2.993103   87
Sun   3.255132   76
Thur  2.771452   62

In [19]:
#select smoker, day, count(*), avg(tip) from tips group by smoker, day
tips.groupby(['smoker', 'day']).agg({'tip': [np.size, np.mean]})

              tip
             size      mean
smoker day
No     Fri    4.0  2.812500
       Sat   45.0  3.102889
       Sun   57.0  3.167895
       Thur  45.0  2.673778
Yes    Fri   15.0  2.714000
       Sat   42.0  2.875476
       Sun   19.0  3.516842
       Thur  17.0  3.030000

In [0]:
df1 = pd.DataFrame({'key': ['A', 'B', 'C', 'D'], 'value': np.random.randn(4)})
df2 = pd.DataFrame({'key': ['B', 'D', 'D', 'E'], 'value': np.random.randn(4)})

In [28]:
df1

  key     value
0   A -0.703362
1   B -0.503667
2   C -0.208610
3   D  1.701500

In [23]:
df2

  key     value
0   B -1.029333
1   D  0.095542
2   D  0.195456
3   E  0.718923

In [24]:
#select * from df1 inner join df2 on df1.key = df2.key;
pd.merge(df1, df2, on='key')

  key   value_x   value_y
0   B -0.503667 -1.029333
1   D  1.701500  0.095542
2   D  1.701500  0.195456

In [25]:
indexed_df2 = df2.set_index('key')
indexed_df2

        value
key
B   -1.029333
D    0.095542
D    0.195456
E    0.718923

In [26]:
pd.merge(df1, indexed_df2, left_on='key', right_index=True)

  key   value_x   value_y
1   B -0.503667 -1.029333
3   D  1.701500  0.095542
3   D  1.701500  0.195456

In [27]:
#select * from df1 left outer join df2 on df1.key = df2.key
pd.merge(df1, df2, on='key', how='left')

  key   value_x   value_y
0   A -0.703362       NaN
1   B -0.503667 -1.029333
2   C -0.208610       NaN
3   D  1.701500  0.095542
4   D  1.701500  0.195456

In [30]:
#selct * from df1 right outr join df2 on df1.key = df2.key
pd.merge(df1, df2, on='key', how='outer')

  key   value_x   value_y
0   A -0.703362       NaN
1   B -0.503667 -1.029333
2   C -0.208610       NaN
3   D  1.701500  0.095542
4   D  1.701500  0.195456
5   E       NaN  0.718923

In [31]:
pd.merge(df1, df2, on='key', how='right')

  key   value_x   value_y
0   B -0.503667 -1.029333
1   D  1.701500  0.095542
2   D  1.701500  0.195456
3   E       NaN  0.718923

In [32]:
#select * from df1 full outer join df2 on df1.key = df2.key;
pd.merge(df1, df2, on='key', how='outer')

  key   value_x   value_y
0   A -0.703362       NaN
1   B -0.503667 -1.029333
2   C -0.208610       NaN
3   D  1.701500  0.095542
4   D  1.701500  0.195456
5   E       NaN  0.718923

In [0]:
df1 = pd.DataFrame({'city': ['Chicago', 'San Francisco', 'New York City'], 'rank': range(1, 4)})
df2 = pd.DataFrame({'city': ['Chicago', 'Boston', 'Los Angeles'], 'rank': [1, 4, 5]})

In [34]:
df1

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3

In [35]:
df2

          city  rank
0      Chicago     1
1       Boston     4
2  Los Angeles     5

In [36]:
#select city, rank from df1 union all select city, rank from df2
pd.concat([df1, df2])

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
0        Chicago     1
1         Boston     4
2    Los Angeles     5

In [37]:
#select city, rank from df1 union select city, rank from df2;
pd.concat([df1, df2]).drop_duplicates()

            city  rank
0        Chicago     1
1  San Francisco     2
2  New York City     3
1         Boston     4
2    Los Angeles     5

In [40]:
#select * from tips order by tip desc limit 10 offset 5
tips.nlargest(10+5, columns='tip').tail(10)

     total_bill   tip     sex smoker   day    time  size
183       23.17  6.50    Male    Yes   Sun  Dinner     4
214       28.17  6.50  Female    Yes   Sat  Dinner     3
47        32.40  6.00    Male     No   Sun  Dinner     4
239       29.03  5.92    Male     No   Sat  Dinner     3
88        24.71  5.85    Male     No  Thur   Lunch     2
181       23.33  5.65    Male    Yes   Sun  Dinner     2
44        30.40  5.60    Male     No   Sun  Dinner     4
52        34.81  5.20  Female     No   Sun  Dinner     4
85        34.83  5.17  Female     No  Thur   Lunch     4
211       25.89  5.16    Male    Yes   Sat  Dinner     4

In [41]:
#select * from (select t.*, row_number() over(partition by day order by total_bill desc) as rn from tips t) where rn < 3 order by day, rn;
(tips.assign(rn=tips.sort_values(['total_bill'], ascending=False).groupby(['day']).cumcount() + 1).query('rn < 3').sort_values(['day', 'rn']))

     total_bill    tip     sex smoker   day    time  size  rn
95        40.17   4.73    Male    Yes   Fri  Dinner     4   1
90        28.97   3.00    Male    Yes   Fri  Dinner     2   2
170       50.81  10.00    Male    Yes   Sat  Dinner     3   1
212       48.33   9.00    Male     No   Sat  Dinner     4   2
156       48.17   5.00    Male     No   Sun  Dinner     6   1
182       45.35   3.50    Male    Yes   Sun  Dinner     3   2
197       43.11   5.00  Female    Yes  Thur   Lunch     4   1
142       41.19   5.00    Male     No  Thur   Lunch     5   2

In [42]:
#same using rank(method='first')
(tips.assign(rnk=tips.groupby(['day'])['total_bill'].rank(method='first', ascending=False)).query('rnk < 3').sort_values(['day', 'rnk']))

     total_bill    tip     sex smoker   day    time  size  rnk
95        40.17   4.73    Male    Yes   Fri  Dinner     4  1.0
90        28.97   3.00    Male    Yes   Fri  Dinner     2  2.0
170       50.81  10.00    Male    Yes   Sat  Dinner     3  1.0
212       48.33   9.00    Male     No   Sat  Dinner     4  2.0
156       48.17   5.00    Male     No   Sun  Dinner     6  1.0
182       45.35   3.50    Male    Yes   Sun  Dinner     3  2.0
197       43.11   5.00  Female    Yes  Thur   Lunch     4  1.0
142       41.19   5.00    Male     No  Thur   Lunch     5  2.0

In [43]:
#-- Oracle's RANK() analytic function
#SELECT * FROM (SELECT t.*, RANK() OVER(PARTITION BY sex ORDER BY tip) AS rnk FROM tips t WHERE tip < 2) WHERE rnk < 3 ORDER BY sex, rnk;
(tips[tips['tip'] < 2].assign(rnk_min=tips.groupby(['sex'])['tip'].rank(method='min')).query('rnk_min < 3').sort_values(['sex', 'rnk_min']))

     total_bill   tip     sex smoker  day    time  size  rnk_min
67         3.07  1.00  Female    Yes  Sat  Dinner     1      1.0
92         5.75  1.00  Female    Yes  Fri  Dinner     2      1.0
111        7.25  1.00  Female     No  Sat  Dinner     1      1.0
236       12.60  1.00    Male    Yes  Sat  Dinner     2      1.0
237       32.83  1.17    Male    Yes  Sat  Dinner     2      2.0

In [0]:
#UPDATE tips SET tip = tip*2 WHERE tip < 2;
tips.loc[tips['tip'] < 2, 'tip'] *= 2

In [0]:
#delete fropm tips where tip > 9;
tips = tips.loc[tips['tip'] <= 9]